<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"dd6552e347d903722ab5d7e4dda0245535fecf82690aa2ae3577afb1629244bd","plan_job_ref":"Job Plan Airflow DAGs #358 at https://github.com/cal-itp/data-infra/actions/runs/16381367813","plan_out_hash":"048684fa693676eda2f64e95a3bfe081e54c31d33c0d107391081bcba400a378","plan_hash":"785708215a18751b7ac75cd2c3600912bb3bc546a81d3cceed51ecad085d3b99","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "XmWZkA==" -> (known after apply)
!~      detect_md5hash      = "jABgKMAYxVm+czmukHiiKw==" -> "different hash"
!~      generation          = 1752855618467062 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "jABgKMAYxVm+czmukHiiKw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["seeds/payments_entity_mapping.csv"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "ADTWuA==" -> (known after apply)
!~      detect_md5hash      = "bEGR2bSCFDvRHqw53kx19A==" -> "different hash"
!~      generation          = 1749663112136418 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/seeds/payments_entity_mapping.csv"
!~      md5hash             = "bEGR2bSCFDvRHqw53kx19A==" -> (known after apply)
        name                = "data/warehouse/seeds/payments_entity_mapping.csv"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "24GPXw==" -> (known after apply)
!~      detect_md5hash      = "R11VD+ssi9yD0q3zetVRwg==" -> "different hash"
!~      generation          = 1752855620512942 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "R11VD+ssi9yD0q3zetVRwg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #358](https://github.com/cal-itp/data-infra/actions/runs/16381367813)